package TaskWithOrganization;
/*Создать абстрактный класс человек, у него будут дети: подчиненный, руководитель.
В базовом классе создать методы разных типов данных (2-ух).
Будет метод, который заносит подчиненного в массив руководителя.
!! Как получиться. Сравнить объекты массивов подчиненных в классе руководителя (использовать метод Equals()).
Использовать геттеры и сеттеры. Проверить есть ли у руководителя подчиненные (isNone).
Сделать необязательные параметры при создании объекта.
Сделать параметр с полом через enum.*/
public class Run {
    public static void main(String[] args) {
        Objects.run();
    }
}
